#!/bin/bash
Что нужно сделать:

Создайте новую ветку dev и переключитесь на неё.
Создайте в ветке dev файл test.sh с произвольным содержимым.
Сделайте несколько коммитов и пушей в ветку dev, имитируя активную работу над файлом в процессе разработки.
Переключитесь на основную ветку.
Добавьте файл main.sh в основной ветке с произвольным содержимым, сделайте комит и пуш . Так имитируется продолжение общекомандной разработки в основной ветке во время разработки отдельного функционала в dev ветке.
Сделайте мердж dev ветки в основную с помощью git merge dev. Напишите осмысленное сообщение в появившееся окно комита.
Сделайте пуш в основной ветке.
Не удаляйте ветку dev.


В качестве ответа прикрепите ссылку на граф коммитов https://github.com/ваш-логин/ваш-репозиторий/network в ваш md-файл с решением.
